._design_docs/.test_reports/mtp-jinja-run-20260608-V1-completion-20260609-000025/S12-MTP-B06-V1-Joriginal/hybrid/k6-stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: D:\source\llama.cpp-jet\tools\server\tests\bench-cache-correctness.js
        output: json (D:\source\llama.cpp-jet\._design_docs\.test_reports\mtp-jinja-run-20260608-V1-completion-20260609-000025\S12-MTP-B06-V1-Joriginal\hybrid\k6-results.json)

     scenarios: (100.00%) 2 scenarios, 2 max VUs, 5m30s max duration (incl. graceful stop):
              * hit_probe: 23 iterations shared among 1 VUs (maxDuration: 5m0s, exec: doProbe, gracefulStop: 30s)
              * warmup: 1 iterations shared among 1 VUs (maxDuration: 2m0s, exec: doWarmup, gracefulStop: 30s)


running (0m01.0s), 1/2 VUs, 5 complete and 0 interrupted iterations
hit_probe   [  17% ] 1 VUs  0m01.0s/5m0s  04/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.3s/2m0s  1/1 shared iters

running (0m02.0s), 1/2 VUs, 10 complete and 0 interrupted iterations
hit_probe   [  39% ] 1 VUs  0m02.0s/5m0s  09/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.3s/2m0s  1/1 shared iters

running (0m03.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
hit_probe   [  61% ] 1 VUs  0m03.0s/5m0s  14/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.3s/2m0s  1/1 shared iters

running (0m04.0s), 1/2 VUs, 20 complete and 0 interrupted iterations
hit_probe   [  83% ] 1 VUs  0m04.0s/5m0s  19/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.3s/2m0s  1/1 shared iters


  █ THRESHOLDS 

    cache_hit_rate
    ✓ 'rate>=0.0' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    prefix_match_rate
    ✓ 'rate>=0.95' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 24      5.264253/s
    checks_succeeded...: 100.00% 24 out of 24
    checks_failed......: 0.00%   0 out of 24

    ✓ warmup 200
    ✓ probe 200

    CUSTOM
    cache_hit_prompt_ms............: avg=11.67ms  min=11.26ms  med=11.63ms  p(95)=11.91ms  max=13.33ms 
    cache_hit_rate.................: 100.00% 23 out of 23
    cache_miss_prompt_ms...........: avg=45.23ms  min=45.23ms  med=45.23ms  p(95)=45.23ms  max=45.23ms 
    cache_n_tokens.................: avg=3.833333 min=0        med=4        p(95)=4        max=4       
    prefix_match_rate..............: 100.00% 23 out of 23
    requests_ok....................: 24      5.264253/s

    HTTP
    http_req_duration..............: avg=98.43ms  min=88.44ms  med=91.68ms  p(95)=121.89ms max=221.07ms
      { expected_response:true }...: avg=98.43ms  min=88.44ms  med=91.68ms  p(95)=121.89ms max=221.07ms
    http_req_failed................: 0.00%   0 out of 24
    http_reqs......................: 24      5.264253/s

    EXECUTION
    iteration_duration.............: avg=203.6ms  min=188.53ms med=192.03ms p(95)=307.39ms max=338.04ms
    iterations.....................: 24      5.264253/s
    vus............................: 1       min=1        max=1
    vus_max........................: 2       min=2        max=2

    NETWORK
    data_received..................: 43 kB   9.4 kB/s
    data_sent......................: 6.1 kB  1.3 kB/s



running (0m04.6s), 0/2 VUs, 24 complete and 0 interrupted iterations
hit_probe ✓ [ 100% ] 1 VUs  0m04.6s/5m0s  23/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.3s/2m0s  1/1 shared iters